000_РОЗНИЦА_ЦЕНТР/src/Catalogs/АналитикаХозяйственныхОпераций/АналитикаХозяйственныхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АналитикаХозяйственныхОпераций</name>
  <predefined>
    <items>
      <name>ВозвратОтПокупателя</name>
      <description>Возврат от покупателя</description>
    </items>
    <items>
      <name>ВозвратПоставщику</name>
      <description>Возврат поставщику</description>
    </items>
    <items>
      <name>КомплектацияНоменклатуры</name>
      <description>Комплектация номенклатуры</description>
    </items>
    <items>
      <name>ОприходованиеПоИнвентаризации</name>
      <description>Оприходование по инвентаризации</description>
    </items>
    <items>
      <name>ОприходованиеПоИнвентаризацииСамостоятельной</name>
      <description>Оприходование по инвентаризации самостоятельной</description>
    </items>
    <items>
      <name>ОприходованиеТоваров</name>
      <description>Оприходование товаров</description>
    </items>
    <items>
      <name>ПередачаПодарочныхСертификатовВПодарок</name>
      <description>Передача подарочных сертификатов в подарок</description>
    </items>
    <items>
      <name>ПередачаТоваровДоРеализации</name>
      <description>Передача товаров до реализации</description>
    </items>
    <items>
      <name>ПередачаТоваровПослеРеализации</name>
      <description>Передача товаров после реализации</description>
    </items>
    <items>
      <name>ПеремещениеТоваров</name>
      <description>Перемещение товаров</description>
    </items>
    <items>
      <name>ПересортицаТоваров</name>
      <description>Пересортица товаров</description>
    </items>
    <items>
      <name>ПогашениеПодарочныхСертификатов</name>
      <description>Погашение подарочных сертификатов</description>
    </items>
    <items>
      <name>ПоступлениеТоваров</name>
      <description>Поступление товаров</description>
    </items>
    <items>
      <name>ПриемТоваровОтДругойОрганизации</name>
      <description>Прием товаров от другой организации</description>
    </items>
    <items>
      <name>ПродажаПодаркаПодарочныйСертификат</name>
      <description>Продажа подарка «Подарочный сертификат»</description>
    </items>
    <items>
      <name>РеализацияТоваров</name>
      <description>Реализация товаров</description>
    </items>
    <items>
      <name>СборкаТоваровПодЗаказПокупателя</name>
      <description>Сборка товаров под заказ покупателя</description>
    </items>
    <items>
      <name>СписаниеНаЗатраты</name>
      <description>Списание на затраты</description>
    </items>
    <items>
      <name>СкидкиПодарки</name>
      <description>Списание на затраты (подарки)</description>
    </items>
    <items>
      <name>СписаниеПоИнвентаризации</name>
      <description>Списание по инвентаризации</description>
    </items>
    <items>
      <name>СписаниеПоИнвентаризацииСамостоятельной</name>
      <description>Списание по инвентаризации самостоятельной</description>
    </items>
  </predefined>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВДругуюКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВДругуюОрганизацию</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассуККМ</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствИзКассыККМ</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗаработнойПлатыПоВедомостям</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗаработнойПлатыРаботнику</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>КонвертацияВалюты</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОплатаФизическомуЛицу</name>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеПоИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровДоРеализации</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровПослеРеализации</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПересортицаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПересортицаТоваровСПереоценкой</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеПодарочныхСертификатов</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзБанка</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассыККМ</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПриемТоваровОтДругойОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>РеализацияТоваров</name>
  </enumValues>
  <enumValues>
    <name>СдачаДенежныхСредствВБанк</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНаЗатраты</name>
  </enumValues>
  <enumValues>
    <name>СписаниеПоИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>СписаниеРасхожденийДенежныхСредств</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/АналитикаХозяйственныхОпераций/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Функция возвращает хозяйственную операцию по умолчанию
//
// Параметры
//	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации
//
// Возвращаемое значение:
//   СправочникСсылка.ХозяйственныеОперации
//
Функция ПолучитьОперациюПоУмолчанию(ХозяйственнаяОперация) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 2
	|	АналитикаХозяйственныхОпераций.Ссылка КАК АналитикаХозяйственнойОперации
	|ИЗ
	|	Справочник.АналитикаХозяйственныхОпераций КАК АналитикаХозяйственныхОпераций
	|ГДЕ
	|	АналитикаХозяйственныхОпераций.ХозяйственнаяОперация = &ХозяйственнаяОперация
	|	И НЕ АналитикаХозяйственныхОпераций.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		АналитикаХозяйственнойОперации = Выборка.АналитикаХозяйственнойОперации;
	Иначе
		АналитикаХозяйственнойОперации = Справочники.АналитикаХозяйственныхОпераций.ПустаяСсылка();
	КонецЕсли;
	
	Возврат АналитикаХозяйственнойОперации;
	
КонецФункции

// Процедура заполняет предопределенные элементы статей движения денежных средств.
//
Процедура ЗаполнитьПредопределенные() Экспорт
	
	Соответствие = Новый Соответствие;

	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ВозвратОтПокупателя,
		Перечисления.ХозяйственныеОперации.ВозвратОтПокупателя);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ВозвратПоставщику,
		Перечисления.ХозяйственныеОперации.ВозвратПоставщику);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.КомплектацияНоменклатуры,
		Перечисления.ХозяйственныеОперации.КомплектацияНоменклатуры);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ОприходованиеТоваров,
		Перечисления.ХозяйственныеОперации.Оприходование);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ОприходованиеПоИнвентаризации,
		Перечисления.ХозяйственныеОперации.ОприходованиеПоИнвентаризации);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ПеремещениеТоваров,
		Перечисления.ХозяйственныеОперации.ПеремещениеТоваров);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ПогашениеПодарочныхСертификатов,
		Перечисления.ХозяйственныеОперации.ПогашениеПодарочныхСертификатов);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ПоступлениеТоваров,
		Перечисления.ХозяйственныеОперации.ПоступлениеТоваров);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.РеализацияТоваров,
		Перечисления.ХозяйственныеОперации.РеализацияТоваров);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ПередачаПодарочныхСертификатовВПодарок,
		Перечисления.ХозяйственныеОперации.РеализацияТоваров);	//	LNK 15.05.2021 06:38:28
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ПродажаПодаркаПодарочныйСертификат,
		Перечисления.ХозяйственныеОперации.РеализацияТоваров);	//	LNK 17.05.2021 06:51:49
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.СкидкиПодарки,
		Перечисления.ХозяйственныеОперации.СписаниеНаЗатраты);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ПередачаТоваровДоРеализации,
		Перечисления.ХозяйственныеОперации.ПередачаТоваровДоРеализации);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ПередачаТоваровПослеРеализации,
		Перечисления.ХозяйственныеОперации.ПередачаТоваровПослеРеализации);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ПриемТоваровОтДругойОрганизации,
		Перечисления.ХозяйственныеОперации.ПриемТоваровОтДругойОрганизации);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.ПересортицаТоваров,
		Перечисления.ХозяйственныеОперации.ПересортицаТоваров);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.СписаниеПоИнвентаризации,
		Перечисления.ХозяйственныеОперации.СписаниеПоИнвентаризации);
	Соответствие.Вставить(Справочники.АналитикаХозяйственныхОпераций.СписаниеНаЗатраты,
		Перечисления.ХозяйственныеОперации.СписаниеНаЗатраты);
		
	Для Каждого Элемент Из Соответствие Цикл
	
		СправочникОбъект = Элемент.Ключ.ПолучитьОбъект();
		Если НЕ СправочникОбъект.ХозяйственнаяОперация = Элемент.Значение Тогда
			СправочникОбъект.ХозяйственнаяОперация = Элемент.Значение;
			Попытка
				СправочникОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#КонецЕсли
